/***************************************************************************
 *   Copyright (C) 2010-2015 by                                            *
 *      Itamar Syn-Hershko <itamar at code972 dot com>                     *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU Affero General Public License           *
 *   version 3, as published by the Free Software Foundation.              *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU Affero General Public License for more details.                   *
 *                                                                         *
 *   You should have received a copy of the GNU Affero General Public      *
 *   License along with this program; if not, see                          *
 *   <http://www.gnu.org/licenses/>.                                       *
 **************************************************************************/
package org.apache.lucene.analysis.hebrew;

import org.apache.lucene.analysis.Analyzer;
import org.apache.lucene.analysis.BaseTokenStreamTestCase;
import org.apache.lucene.analysis.TokenStream;
import org.apache.lucene.analysis.tokenattributes.CharTermAttribute;
import org.junit.Ignore;
import org.junit.Test;

import java.io.IOException;

public class TestHebrewQueryLightAnalyzer extends BaseTokenStreamTestCase {
    public void testBasics() throws IOException {
        Analyzer a = TestBase.getHebrewQueryLightAnalyzer();

        assertAnalyzesTo(a, "אימא", new String[]{"אימא"}); // recognized word, lemmatized
        assertAnalyzesTo(a, "אימא$", new String[]{"אימא$"}); // recognized word, lemmatized
        assertAnalyzesTo(a, "בדיקהבדיקה", new String[]{"בדיקהבדיקה"}); // OOV
        assertAnalyzesTo(a, "בדיקהבדיקה$", new String[]{"בדיקהבדיקה$"}); // OOV
        assertAnalyzesTo(a, "ץץץץץץץץץץץ", new String[]{}); // Invalid, treated as noise
        assertAnalyzesTo(a, "ץץץץץץץץץץץ$", new String[]{}); // Invalid, treated as noise

        // Test non-Hebrew
        assertAnalyzesTo(a, "book", new String[]{"book$", "book"});
        assertAnalyzesTo(a, "book$", new String[]{"book$"});
        assertAnalyzesTo(a, "steven's", new String[]{"steven's$", "steven's"});
        assertAnalyzesTo(a, "steven\u2019s", new String[]{"steven's$", "steven's"});
        //assertAnalyzesTo(a, "steven\uFF07s", new String[]{"steven's$", "steven's"});
        checkOneTerm(a, "3", "3");
    }

    @Ignore
    public void testRegress() throws IOException {
        Analyzer analyzer = TestBase.getHebrewQueryLightAnalyzer();
        String input = TestBase.readFileToString("./../test-files/1371379368027561.txt");
        String[] output = {"שניים", "שני", "ישן", "שינה", "שנה", "שני", "עשור", "הקמה", "פעילה", "פעילות", "מי", "מים", "עדן", "עד", "עידן",
                "נמכר", "לפלנד", "פה", "פי", "שווי", "שווה", "שיווה", "וו", "של", "נשל", "240", "מיליון", "הורה", "שוק", "הון", "מי", "מים",
                "עדן", "עד", "עידן", "מעיין", "עיין", "עין", "חברה", "חבר", "בורסאי", "מחזיקה", "מחזיק", "החזיק", "70", "פעילה", "פעילות",
                "ישראל", "ישראל", "אירופה", "קיבל", "120", "מיליון", "שקל", "קל", "נטו", "נטה", "רוכשת", "רכש", "קרן", "השקעה", "פרטי", "רואן",
                "קפיטל", "15", "שניים", "שני", "שני", "עשור", "אחרי", "איחר", "אחר", "הוקם", "close$", "close", "מי", "מים", "עדן", "עד", "עידן",
                "נתון", "מסחר", "סחר", "המלצה", "אנליסט", "הרשמה", "רשם", "נתון", "זמן", "זימן", "אמת", "אמה", "אימת", "חדשה", "חדש", "חברה",
                "חבר", "חיבר", "הוסיף", "הוסף", "תיק", "איש", "אישי", "גרף", "גירף", "ניתוח", "טכני", "מי", "מים", "עדן", "עד", "עידן", "מעיין",
                "עיין", "עין", "דיווח", "בוקר", "כי", "מכרה", "מכר", "כר", "רה", "את", "את", "פעילות", "ישראל", "ישראל", "אירופה", "יד", "קרן",
                "רון", "רנן", "קפיטל", "rhone$", "rhone", "capital$", "capital", "לפלנד", "פה", "פי", "שווי", "שווה", "שיווה", "וו", "של", "נשל",
                "240", "מיליון", "הורה", "1", "2", "מיליארד", "שקל", "קל", "איחר", "אחרי", "אחר", "פעילה", "פעילות", "הוחזק", "יד", "חברה", "חבר",
                "בת", "70", "עדן", "עד", "עידן", "הולנד", "חלקה", "חלק", "חילק", "של", "נשל", "מי", "מים", "עדן", "עד", "עידן", "מעיין", "עיין",
                "עין", "עסקה", "עסק", "עומד", "עמד", "על", "70", "מיליון", "הורה", "אולם", "תמורה", "נטו", "נטה", "סוף", "של", "נשל", "דבר",
                "דיבר", "צפוי", "הסתכם", "24", "24", "מיליון", "הורה", "120", "מיליון", "שקל", "קל", "ניכוי", "הלוואה", "בעל", "עלה", "הוצאה",
                "עסקה", "עסק", "שונות", "שנה", "שונה", "מחיר", "מכירה", "הכיר", "כירה", "סוף", "סופי", "נמצא", "מצא", "רף", "תחתון", "של", "נשל",
                "טווח", "טיווח", "השווה", "שווי", "שווה", "עסקה", "עסק", "כף", "כפה", "פה", "פי", "הוערך", "שוק", "מהלך", "מהל", "הילך", "חודש",
                "אחרון", "עם", "פרסום", "דו\"ח", "כספי", "רבעון", "ראשון", "של", "נשל", "2013", "מי", "מים", "עדן", "עד", "עידן", "מעיין", "עיין",
                "עין", "דיווח", "כי", "העסקה", "עסקה", "עסק", "צפוי", "נסגר", "מחיר", "נמוך", "170", "מיליון", "שקל", "קל", "תוצאה", "תוצא", "כך",
                "מניה", "מנייה", "חברה", "חבר", "צנח", "מהלך", "מהל", "הילך", "מסחר", "סחר", "34", "כך", "שווי", "של", "נשל", "מי", "מים", "עדן",
                "עד", "עידן", "מעיין", "עיין", "עין", "עומד", "עמד", "עת", "של", "נשל", "113", "מיליון", "שקל", "קל", "מעט", "מיעט", "מעט", "עט",
                "מתח", "תחת", "שווי", "שווה", "העסקה", "עסקה", "עסק", "סוף", "סופי", "מי", "מים", "עדן", "עד", "עידן", "צילום", "עופר", "קניין",
                "קרן", "רואן", "קפיטל", "יין", "קרן", "פירוט", "פרט", "פרוט", "אקוטי", "נוסד", "שנת", "שינה", "שנה", "1996", "הקרין", "קרן",
                "יין", "גלובלי", "התמקד", "השקעה", "פעילות", "הוביל", "עם", "נוכחת", "נוכחות", "נוכח", "נכח", "פן", "פן", "אירופה", "או", "טרנס",
                "אטלנטי", "בעלות", "בעל", "עלות", "עלה", "פוטנציאל", "צמיחה", "רב", "לאום", "לאומי", "אום", "לרואן", "משרד", "לונדון", "בן",
                "יורק", "הורק", "ירק", "נכון", "היום", "היא", "מחזיקה", "מחזיק", "החזיק", "בפורטפוליו", "השקעה", "מגוון", "גוון", "גיוון", "גו",
                "כלל", "השקעה", "כימיקל", "מוצר", "הוצר", "צריכה", "צריך", "מזון", "תעשייה", "כר", "תובלה", "תובל", "מהלך", "מהל", "הילך",
                "תקופה", "תקוף", "אחרונה", "אחרון", "פועלת", "פעל", "מי", "מים", "עדן", "עד", "עידן", "הולנד", "מימוש", "אסטרטגיה", "אסטרטג",
                "עסקי", "חדשה", "חידש", "חדש", "כלל", "הגברה", "הגביר", "גברת", "גבר", "פעילה", "פעילות", "שוק", "הקפה", "קפה", "קפה", "על",
                "חשבון", "פעילה", "פעילות", "מסורתי", "תחום", "תחם", "כד", "די", "די", "בקבוק", "קבוקי", "מים", "ים", "הקרין", "קרן", "חדשה",
                "חדש", "עתיד", "המשיך", "השקיע", "פעילה", "פעילות", "הקפה", "קפה", "קפה", "הרחיב", "אירופה", "מנכ\"ל", "מי", "מים", "עדן", "עד",
                "עידן", "הולנד", "רענן", "זילברמן", "המשיך", "ניהל", "את", "את", "חברה", "חבר", "גם", "תחת", "הקרין", "קרן", "חדשה", "חדש",
                "הדגיש", "רכישה", "היווה", "הווה", "הזדמנות", "האיץ", "את", "את", "התרחבות", "אסטרטגיה", "אסטרטג", "עסקי", "כף", "כפה", "פה",
                "פי", "הותווה", "שנים", "שנה", "אחרונה", "כלל", "פיתוח", "נוסף", "הוסף", "של", "נשל", "סל", "מילא", "מלא", "לא", "של", "נשל",
                "מוצר", "הוצר", "מים", "ים", "שירות", "נלווה", "מקביל", "הקביל", "פיתוח", "שירות", "קפה", "קפה", "משרד", "בית", "דרש", "השקעה",
                "משמעותי", "שיווק", "ציוד", "פיתוח", "עסק", "רכישה", "חברה", "חברות", "השלים", "ימה", "אנחנו", "בחן", "גם", "את", "את", "אפשרות",
                "נכנס", "שוק", "בינלאומי", "נוסף", "יוחד", "מיוחד", "מזרח", "אירופה", "בי", "דרישה", "מים", "מינראליים", "גבר", "אנו", "שמח",
                "שיתף", "פעולה", "עם", "קרן", "רואן", "בישום", "חזון", "שותף", "מאמין", "האמין", "אמין", "כי", "ניסיון", "של", "נשל", "רואן",
                "יצירה", "ערך", "פעילות", "נרכש", "תהייה", "תרומה", "רומה", "תרום", "משמעותי", "המשך", "התפתחות", "של", "נשל", "חברה", "חבר",
                "בעל", "על", "עלה", "מניה", "מנייה", "יצא", "יוצא", "רון", "רנן", "יהודה", "נפתלי", "נפתל", "70", "קרן", "אוך", "זיף", "27", "25",
                "החליט", "ממש", "מימש", "את", "את", "חברה", "חבר", "חלק", "חילק", "הסכם", "השקעה", "נחת", "נחתם", "נח", "בין", "ין", "אח",
                "נפתלי", "נפתל", "קרן", "2007", "הקרין", "קרן", "השקיע", "שקיעה", "אז", "כמה", "כמה", "עשרת", "מיליון", "הורה", "חברה", "חבר",
                "חיבר", "העניק", "לי", "לה", "הלוואה", "בעל", "עלה", "של", "נשל", "25", "מיליון", "הורה", "חלק", "חילק", "הסכם", "ניתן", "קרן",
                "אופציה", "נכנס", "תקף", "תקוף", "מהלך", "מהל", "הילך", "דצמבר", "2012", "ממש", "מימש", "השקעה", "אילץ", "גם", "את", "את", "שאר",
                "אר", "בעל", "על", "עלה", "מניה", "מנייה", "מכר", "מכור", "את", "את", "מניה", "מנייה", };
        assertAnalyzesTo(analyzer,input,output);
    }
}
